2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_rcc.c
/**
*     Copyright (c) 2025, Nsing Technologies Inc.
* 
*     All rights reserved.
*
*     This software is the exclusive property of Nsing Technologies Inc. (Hereinafter 
* referred to as Nsing). This software, and the product of Nsing described herein 
* (Hereinafter referred to as the Product) are owned by Nsing under the laws and treaties
* of the People's Republic of China and other applicable jurisdictions worldwide.
*
*     Nsing does not grant any license under its patents, copyrights, trademarks, or other 
* intellectual property rights. Names and brands of third party may be mentioned or referred 
* thereto (if any) for identification purposes only.
*
*     Nsing reserves the right to make changes, corrections, enhancements, modifications, and 
* improvements to this software at any time without notice. Please contact Nsing and obtain 
* the latest version of this software before placing orders.

*     Although Nsing has attempted to provide accurate and reliable information, Nsing assumes 
* no responsibility for the accuracy and reliability of this software.
* 
*     It is the responsibility of the user of this software to properly design, program, and test 
* the functionality and safety of any application made of this information and any resulting product. 
* In no event shall Nsing be liable for any direct, indirect, incidental, special,exemplary, or 
* consequential damages arising in any way out of the use of this software or the Product.
*
*     Nsing Products are neither intended nor warranted for usage in systems or equipment, any
* malfunction or failure of which may cause loss of human life, bodily injury or severe property 
* damage. Such applications are deemed, "Insecure Usage".
*
*     All Insecure Usage shall be made at user's risk. User shall indemnify Nsing and hold Nsing 
* harmless from and against all claims, costs, damages, and other liabilities, arising from or related 
* to any customer's Insecure Usage.

*     Any express or implied warranty with regard to this software or the Product, including,but not 
* limited to, the warranties of merchantability, fitness for a particular purpose and non-infringement
* are disclaimed to the fullest extent permitted by law.

*     Unless otherwise explicitly permitted by Nsing, anyone may not duplicate, modify, transcribe
* or otherwise distribute this software for any purposes, in whole or in part.
*
*     Nsing products and technologies shall not be used for or incorporated into any products or systems
* whose manufacture, use, or sale is prohibited under any applicable domestic or foreign laws or regulations. 
* User shall comply with any applicable export control laws and regulations promulgated and administered by 
* the governments of any countries asserting jurisdiction over the parties or transactions.
**/

/**
*\*\file n32g033_rcc.c
*\*\author Nsing
*\*\version v1.0.0
*\*\copyright Copyright (c) 2025, Nsing Technologies Inc. All rights reserved.
**/

#include "n32g033_rcc.h"

/**
*\*\name    RCC_DeInit.
*\*\fun     Reset the RCC registers.
*\*\param   none 
*\*\return  none 
**/
void RCC_DeInit(void)
{
    /* Set HSIEN bit */
    RCC->CTRL |= (uint32_t)0x00000001U;

    /* Reset SYSPRES, SCLKSW, MCO and MCOPRES bits */
    RCC->CFG &= (uint32_t)0x83FEFFFEU;

    /* Reset CFG2 register */
    RCC->CFG2 = 0x00000000U;

    /* Reset TIMFILTCFG register */
    RCC->TIMFILTCFG &= ~((uint32_t)0x001F1F1FU);	
}

/**
*\*\name    RCC_EnableHsi.
*\*\fun     Enables the Internal High Speed oscillator (HSI).
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE  
*\*\return  none
*\*\note   HSI can not be stopped if it is used directly or through the PLL as system clock.
**/ 
void RCC_EnableHsi(FunctionalState Cmd)
{
    if(Cmd == ENABLE)
   {
       /* Set HSIEN bit */
       RCC->CTRL |= RCC_HSI_ENABLE;
   }
   else
   {
       /* Reset HSIEN bit */
       RCC->CTRL &= (~RCC_HSI_ENABLE);
   }
}

/**
*\*\name    RCC_WaitHsiStable.
*\*\fun     Waits for HSI start-up.
*\*\param   none
*\*\return  ErrorStatus:
 *\*\         - SUCCESS    HSI oscillator is stable and ready to use
 *\*\         - ERROR      HSI oscillator not yet ready
**/
ErrorStatus RCC_WaitHsiStable(void)
{
    __IO uint32_t StartUpCounter = 0;
    ErrorStatus status;
    FlagStatus HSIStatus;

    /* Wait till HSI is ready and if Time out is reached exit */
    do
    {
        HSIStatus = RCC_GetFlagStatus(RCC_CTRL_FLAG_HSIRDF);
        StartUpCounter++;
    } while ((StartUpCounter != HSI_STARTUP_TIMEOUT) && (HSIStatus == RESET));

    if (RCC_GetFlagStatus(RCC_CTRL_FLAG_HSIRDF) != RESET)
    {
        status = SUCCESS;
    }
    else
    {
        status = ERROR;
    }
    return (status);
}

/**
*\*\name    RCC_SetHsiCalibValue.
*\*\fun     Adjusts the Internal High Speed oscillator (HSI) calibration value.
*\*\param   calibration_value(the calibration trimming value):
*\*\        This parameter must be a number between 0 and 0x3FF
*\*\return  none
**/ 
void RCC_SetHsiCalibValue(uint16_t calibration_value)
{
    uint32_t tmpregister;

    tmpregister = RCC->CTRL;
    /* Clear HSITRIM[22:13] bits */
    tmpregister &= CTRL_HSITRIM_MASK;
    /* Set the HSITRIM[22:13] bits according to calibration_value value */
    tmpregister |= (uint32_t)calibration_value << 13;
    /* Store the new value */
    RCC->CTRL = tmpregister;
}

/**
*\*\name    RCC_ConfigLsiCalibSource.
*\*\fun     Configures LSI calibration values source.
*\*\param   cal_src:
*\*\	     - RCC_LSICAL_SRC_AFEC       LSI calibration values are sourced from AFEC
*\*\	     - RCC_LSICAL_SRC_TRIM       LSI calibration values are sourced from LSITRIM
*\*\return  none
**/
void RCC_ConfigLsiCalibSource(uint32_t cal_src)
{
    uint32_t tmpregister;
	
    tmpregister = RCC->LSCTRL;
    /* Clear TRIMSEL bits */
    tmpregister &= LSCTRL_TRIMSEL_MASK;
    /* Set TRIMSEL bits according to cal_src value */
    tmpregister |= cal_src;
    /* Store the new value */
    RCC->LSCTRL = tmpregister;
}

/**
*\*\name    RCC_SetLsiCalibValue.
*\*\fun     Adjusts the Internal Low Speed oscillator (LSI) calibration value.
*\*\param   calibration_value(the calibration trimming value):
*\*\        This parameter must be a number between 0 and 0x1FF
*\*\return  none
**/ 
void RCC_SetLsiCalibValue(uint16_t calibration_value)
{
    uint32_t tmpregister;

    tmpregister = RCC->LSCTRL;
    /* Clear LSITRIM[8:0] bits */
    tmpregister &= LSCTRL_LSITRIM_MASK;
    /* Set the LSITRIM[8:0] bits according to calibration_value value */
    tmpregister |= (uint32_t)calibration_value;
    /* Store the new value */
    RCC->LSCTRL = tmpregister;
}

/**
*\*\name    RCC_ConfigSysclkPres.
*\*\fun     Configures the system clock (SYSCLK) prescaler.
*\*\param   sysclk_pres(HSI divider used as system clock):
*\*\	     - RCC_SYSCLK_PRES_DIV1       HSI divide 1 used as system clock
*\*\	     - RCC_SYSCLK_PRES_DIV2       HSI divide 2 used as system clock
*\*\return  none
**/
void RCC_ConfigSysclkPres(uint32_t sysclk_pres)
{
    uint32_t tmpregister;
	
    tmpregister = RCC->CFG;
    /* Clear SYSPRES bits */
    tmpregister &= CFG_SYSPRES_MASK;
    /* Set SYSPRES bits according to sysclk_pres value */
    tmpregister |= sysclk_pres;
    /* Store the new value */
    RCC->CFG = tmpregister;
}

/**
*\*\name    RCC_ConfigSysclk.
*\*\fun     Configures the system clock (SYSCLK).
*\*\param   sysclk_source(clock source used as system clock):
*\*\	     - RCC_SYSCLK_SRC_HSI       HSI(or divide 2) selected as system clock
*\*\	     - RCC_SYSCLK_SRC_LSI       LSI selected as system clock
*\*\return  none
**/
void RCC_ConfigSysclk(uint32_t sysclk_source)
{
    uint32_t tmpregister;
	
    tmpregister = RCC->CFG;
    /* Clear SW[0] bits */
    tmpregister &= CFG_SCLKSW_MASK;
    /* Set SW[0] bits according to sysclk_source value */
    tmpregister |= sysclk_source;
    /* Store the new value */
    RCC->CFG = tmpregister;
}

/**
*\*\name    RCC_GetSysclkSrc.
*\*\fun     Returns the clock source used as system clock.
*\*\param   none
*\*\return  (The clock source used as system clock):
*\*\         - RCC_CFG_SCLKSTS_HSI    HSI used as system clock  
*\*\         - RCC_CFG_SCLKSTS_LSI    LSI used as system clock
**/
uint32_t RCC_GetSysclkSrc(void)
{
    return ((uint32_t)(RCC->CFG & CFG_SCLKSTS_MASK));
}

/**
*\*\name    RCC_ConfigHclk.
*\*\fun     Configures the AHB clock (HCLK).
*\*\param   sysclk_div(AHB clock is derived from the system clock (SYSCLK)):
*\*\         - RCC_SYSCLK_DIV1      AHB clock = SYSCLK
*\*\         - RCC_SYSCLK_DIV2      AHB clock = SYSCLK/2
*\*\         - RCC_SYSCLK_DIV4      AHB clock = SYSCLK/4
*\*\         - RCC_SYSCLK_DIV8      AHB clock = SYSCLK/8
*\*\         - RCC_SYSCLK_DIV16     AHB clock = SYSCLK/16
*\*\return  none
**/
void RCC_ConfigHclk(uint32_t sysclk_div)
{
    uint32_t tmpregister;
	
    tmpregister = RCC->CFG;
    /* Clear HPRE[6:4] bits */
    tmpregister &= CFG_HPRE_MASK;
    /* Set HPRE[2:0] bits according to sysclk_div value */
    tmpregister |= sysclk_div;
    /* Store the new value */
    RCC->CFG = tmpregister;
}

/**
*\*\name    RCC_ConfigPclk.
*\*\fun     Configures the Low Speed APB clock (PCLK).
*\*\param   hclk_div(APB clock is derived from the AHB clock (HCLK)):
*\*\         - RCC_HCLK_DIV1     APB clock = HCLK
*\*\         - RCC_HCLK_DIV2     APB clock = HCLK/2
*\*\         - RCC_HCLK_DIV4     APB clock = HCLK/4
*\*\         - RCC_HCLK_DIV8     APB clock = HCLK/8
*\*\         - RCC_HCLK_DIV16    APB clock = HCLK/16
*\*\return  none
**/
void RCC_ConfigPclk(uint32_t hclk_div)
{
    uint32_t tmpregister;

    tmpregister = RCC->CFG;
    /* Clear APBPRES[10:8] bits */
    tmpregister &= CFG_APBPRES_MASK;
    /* Set APBPRES[2:0] bits according to RCC_HCLK value */
    tmpregister |= hclk_div;
    /* Store the new value */
    RCC->CFG = tmpregister;
}

/**
*\*\name    RCC_ConfigAdcHclk.
*\*\fun     Configures the ADCHCLK prescaler.
*\*\param   hclk_prescaler(ADCHCLK prescaler):
*\*\         - RCC_ADCHCLK_DIV2        ADCHPRE[2:0] = 000,  HCLK Clock Divided By 2
*\*\         - RCC_ADCHCLK_DIV4        ADCHPRE[2:0] = 011,  HCLK Clock Divided By 4
*\*\         - RCC_ADCHCLK_DIV16       ADCHPRE[2:0] = 101, HCLK Clock Divided By 16
*\*\         - RCC_ADCHCLK_DIV32       ADCHPRE[2:0] = 110, HCLK Clock Divided By 32
*\*\         - RCC_ADCHCLK_DIV_OTHERS  ADCHPRE[2:0] = others, HCLK Clock Divided By 32
*\*\return  none
**/
void RCC_ConfigAdcHclk(uint32_t hclk_prescaler)
{
    uint32_t tmpregister;

