2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_rcc.c
    tmpregister = RCC->CFG2;
    /* Clear ADCHPRE[2:0] bits */
    tmpregister &= CFG2_ADCHPRE_MASK;
    /* Set ADCHPRE[2:0] bits according to hclk_prescaler value */
    tmpregister |= hclk_prescaler;

    /* Store the new value */
    RCC->CFG2 = tmpregister;
}

/**
*\*\name    RCC_GetClocksFreqValue.
*\*\fun     Returns the frequencies of different on chip clocks.
*\*\param   RCC_clocks pointer to a RCC_ClocksType structure which will hold
*\*\        the clocks frequencies.
*\*\return  none
**/
void RCC_GetClocksFreqValue(RCC_ClocksType* RCC_Clocks)
{
    uint32_t tmp, presc;
    const uint8_t s_ApbAhbPresTable[16]     = {0, 0, 0, 0, 1, 2, 3, 4, 1, 2, 3, 4, 6, 7, 8, 9};
    const uint8_t s_AdcHclkPresTable[16]    = {1, 2, 3, 4, 6, 8, 10, 12, 16, 32, 32, 32, 32, 32, 32, 32};

    /* Get SYSCLK source -------------------------------------------------------*/
    tmp = RCC->CFG & CFG_SCLKSTS_MASK;

    switch (tmp)
    {
        case RCC_CFG_SCLKSTS_HSI: /* HSI used as system clock */
            RCC_Clocks->SysclkFreq = HSI_VALUE;
            break;
        case RCC_CFG_SCLKSTS_LSI: /* LSI used as system clock */
            RCC_Clocks->SysclkFreq = LSI_VALUE;
            break;

        default:
            RCC_Clocks->SysclkFreq = HSI_VALUE;
            break;
    }
    
    if((RCC->CFG & RCC_CFG_SYSPRES) == RCC_CFG_SYSPRES)
    {
        RCC_Clocks->SysclkFreq = (HSI_VALUE/2);
    }
    else 
    {
        /* No processing */
    }

    /* Compute HCLK, PCLK1, PCLK2 and ADCCLK clocks frequencies ----------------*/
    /* Get HCLK prescaler */
    tmp   = RCC->CFG & RCC_CFG_AHBPRES;
    tmp   = tmp >> 4;
    presc = s_ApbAhbPresTable[tmp];
    /* HCLK clock frequency */
    RCC_Clocks->HclkFreq = RCC_Clocks->SysclkFreq >> presc;
    
    /* Get PCLK prescaler */
    tmp   = RCC->CFG & RCC_CFG_APBPRES;
    tmp   = tmp >> 8;
    presc = s_ApbAhbPresTable[tmp];
    /* PCLK clock frequency */
    RCC_Clocks->PclkFreq = RCC_Clocks->HclkFreq >> presc;

    /* Get ADCHCLK prescaler */
    tmp   = RCC->CFG2 & RCC_CFG2_ADCHPRE;
    presc = s_AdcHclkPresTable[tmp];
    /* ADCHCLK clock frequency */
    RCC_Clocks->AdcHclkFreq = RCC_Clocks->HclkFreq / presc;
				
}

/**
*\*\name    RCC_EnableAHBPeriphClk.
*\*\fun     Enables the AHB peripheral clock.
*\*\param   AHB_periph (AHB peripheral to gates its clock):
*\*\        - RCC_AHB_PERIPH_SQRT  
*\*\        - RCC_AHB_PERIPH_HDIV 
*\*\        - RCC_AHB_PERIPH_ADC    
*\*\        - RCC_AHB_PERIPH_DMA 
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE    
*\*\return  none
**/
void RCC_EnableAHBPeriphClk(uint32_t AHB_periph, FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        RCC->AHBPCLKEN |= AHB_periph;
    }
    else
    {
        RCC->AHBPCLKEN &= ~AHB_periph;
    }
}

/**
*\*\name    RCC_EnableAPBPeriphClk.
*\*\fun     Enables the High Speed APB peripheral clock.
*\*\param   APB_periph (APB peripheral to gates its clock):
*\*\        - RCC_APB_PERIPH_GPIO    
*\*\        - RCC_APB_PERIPH_I2C1    
*\*\        - RCC_APB_PERIPH_I2C2    
*\*\        - RCC_APB_PERIPH_PWR
*\*\        - RCC_APB_PERIPH_SPI1     
*\*\        - RCC_APB_PERIPH_SPI2   
*\*\        - RCC_APB_PERIPH_TIM1   
*\*\        - RCC_APB_PERIPH_TIM3   
*\*\        - RCC_APB_PERIPH_TIM4   
*\*\        - RCC_APB_PERIPH_TIM6    
*\*\        - RCC_APB_PERIPH_UART1    
*\*\        - RCC_APB_PERIPH_UART2     
*\*\        - RCC_APB_PERIPH_UART3     
*\*\        - RCC_APB_PERIPH_COMP  
*\*\        - RCC_APB_PERIPH_COMPFILT  
*\*\        - RCC_APB_PERIPH_OPA 
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE       
*\*\return none. 
**/
void RCC_EnableAPBPeriphClk(uint32_t APB_periph, FunctionalState Cmd)
{
    if (Cmd != DISABLE)
    {
        RCC->APBPCLKEN |= APB_periph;
    }
    else
    {
        RCC->APBPCLKEN &= ~APB_periph;
    }
}

/**
*\*\name    RCC_EnableAHBPeriphReset.
*\*\fun     AHB peripheral reset.
*\*\param   AHB_periph specifies the AHB peripheral to reset.    
*\*\        - RCC_AHB_PERIPH_SQRT  
*\*\        - RCC_AHB_PERIPH_HDIV 
*\*\        - RCC_AHB_PERIPH_ADC 
*\*\return none.
**/
void RCC_EnableAHBPeriphReset(uint32_t AHB_periph)
{
    RCC->AHBPRST |= AHB_periph;
    RCC->AHBPRST &= ~AHB_periph;   
}

/**
*\*\name    RCC_EnableAPB1PeriphReset.
*\*\fun     Low Speed APB (APB1) peripheral reset.
*\*\param   APB1_periph specifies the APB1 peripheral to reset.
*\*\        - RCC_APB_PERIPH_GPIO    
*\*\        - RCC_APB_PERIPH_I2C1    
*\*\        - RCC_APB_PERIPH_I2C2     
*\*\        - RCC_APB_PERIPH_SPI1   
*\*\        - RCC_APB_PERIPH_SPI2   
*\*\        - RCC_APB_PERIPH_TIM1   
*\*\        - RCC_APB_PERIPH_TIM3   
*\*\        - RCC_APB_PERIPH_TIM4    
*\*\        - RCC_APB_PERIPH_TIM6    
*\*\        - RCC_APB_PERIPH_UART1     
*\*\        - RCC_APB_PERIPH_UART2     
*\*\        - RCC_APB_PERIPH_UART3 
*\*\        - RCC_APB_PERIPH_COMP
*\*\        - RCC_APB_PERIPH_OPA
*\*\return none. 
**/
void RCC_EnableAPBPeriphReset(uint32_t APB_periph)
{
    
    RCC->APBPRST |= APB_periph;
    RCC->APBPRST &= ~APB_periph;
    
}

/**
*\*\name    RCC_ConfigMcoClkPre.
*\*\fun         Configures the MCO System and HSI clock prescaler.
*\*\param   MCO_PLL_prescaler specifies the MCO PLL clock prescaler.
*\*\      This parameter can be on of the following values:
*\*\        - RCC_MCO_CLK_DIV2    MCOPRE[2:0] = 010, System and HSI Clock Divided By 2
*\*\        - RCC_MCO_CLK_DIV3    MCOPRE[2:0] = 011, System and HSI Clock Divided By 3
*\*\        - RCC_MCO_CLK_DIV4    MCOPRE[2:0] = 100, System and HSI Clock Divided By 4
*\*\        - RCC_MCO_CLK_DIV5    MCOPRE[2:0] = 101, System and HSI Clock Divided By 5
*\*\        - RCC_MCO_CLK_DIV6    MCOPRE[2:0] = 110, System and HSI Clock Divided By 6
*\*\        - RCC_MCO_CLK_DIV7    MCOPRE[2:0] = 111, System and HSI Clock Divided By 7
*\*\return  none. 
 */
void RCC_ConfigMcoClkPre(uint32_t MCO_PLL_prescaler)
{
    uint32_t tmpregister;

    tmpregister = RCC->CFG;
    /* Clear MCOPRE[30:28] bits */
    tmpregister &= RCC_MCO_DIV_MASK;
    /* Set MCOPRE[30:28] bits according to MCO_PLL_prescaler value */
    tmpregister |= MCO_PLL_prescaler;

