2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_rcc.c
    /* Store the new value */
    RCC->CFG = tmpregister;
}

/**
*\*\name   RCC_ConfigMco.
*\*\fun    Selects the clock source to output on MCO pin.
*\*\param  MCO_source(clock source to output): 
*\*\        - RCC_MCO_NOCLK       No clock selected
*\*\        - RCC_MCO_LSI         LSI oscillator clock selected
*\*\        - RCC_MCO_SYSCLK      System clock selected
*\*\        - RCC_MCO_HSI         HSI oscillator clock selected
*\*\return  none. 
**/
void RCC_ConfigMco(uint32_t MCO_source)
{
    uint32_t tmpregister;

    tmpregister = RCC->CFG;
    /* Clear MCO[27:26] bits */
    tmpregister &= RCC_MCO_MASK;
    /* Set MCO[27:26] bits according to RCC_MCO value */
    tmpregister |= MCO_source;

    /* Store the new value */
    RCC->CFG = tmpregister;
}

/**
*\*\name    RCC_GetFlagStatus.
*\*\fun     Checks whether the specified RCC flag is set or not.
*\*\param   RCC_flag:
*\*\	      - RCC_CTRL_FLAG_HSIRDF           HSI oscillator clock ready
*\*\	      - RCC_CTRL_FLAG_LSICALCF         LSI Calibration finish 
*\*\	      - RCC_CLKINT_FLAG_LSIRDF         LSI oscillator clock ready
*\*\	      - RCC_CTRLSTS_FLAG_PINRSTF       Pin reset
*\*\	      - RCC_CTRLSTS_FLAG_PORRSTF       POR/PDR reset
*\*\	      - RCC_CTRLSTS_FLAG_SFTRSTF       Software reset
*\*\	      - RCC_CTRLSTS_FLAG_IWDGRSTF      Independent Watchdog reset
*\*\	      - RCC_CTRLSTS_FLAG_GLITCHF       Glitch reset
*\*\	      - RCC_CTRLSTS_FLAG_EMCGBNRSTF    EMCGBN reset
*\*\	      - RCC_CTRLSTS_FLAG_EMCGBRSTF     EMCGB reset
*\*\	      - RCC_CTRLSTS_FLAG_LKUPRSTF      M0 lock up reset
*\*\	      - RCC_CTRLSTS_FLAG_HSILOSEF      HSI lose reset
*\*\return  FlagStatus:    
*\*\      	  - SET 
*\*\  	      - RESET
 */
FlagStatus RCC_GetFlagStatus(uint8_t RCC_FLAG)
{
    uint32_t tmp, statusreg;
    FlagStatus bitstatus;

    /* Get the RCC register index */
    tmp = (uint32_t)RCC_FLAG >> 5;
    if (tmp == 1) /* The flag to check is in CTRL register */
    {
        statusreg = RCC->CTRL;
    }
    else if (tmp == 2) /* The flag to check is in CLKINT register */
    {
        statusreg = RCC->CLKINT;
    }
    else /* The flag to check is in CTRLSTS register */
    {
        statusreg = RCC->CTRLSTS;
    }

    /* Get the flag position */
    tmp = (uint32_t)RCC_FLAG & RCC_FLAG_MASK;
    if ((statusreg & ((uint32_t)1 << tmp)) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    /* Return the flag status */
    return bitstatus;
}

/**
*\*\name    RCC_ClearResetFlag.
*\*\fun     Clears the RCC reset flags.
*\*\param   none
*\*\return  none
*\*\note  Clear the following flags:
*\*\	      - RCC_CTRLSTS_FLAG_PINRSTF       Pin reset
*\*\	      - RCC_CTRLSTS_FLAG_PORRSTF       POR/PDR reset
*\*\	      - RCC_CTRLSTS_FLAG_SFTRSTF       Software reset
*\*\	      - RCC_CTRLSTS_FLAG_IWDGRSTF      Independent Watchdog reset
*\*\	      - RCC_CTRLSTS_FLAG_GLITCHF       Glitch reset
*\*\	      - RCC_CTRLSTS_FLAG_EMCGBNRSTF    EMCGBN reset
*\*\	      - RCC_CTRLSTS_FLAG_EMCGBRSTF     EMCGB reset
*\*\	      - RCC_CTRLSTS_FLAG_LKUPRSTF      M0 lock up reset
*\*\	      - RCC_CTRLSTS_FLAG_HSILOSEF      HSI lose reset
**/
void RCC_ClearResetFlag(void)
{
    /* Set RMVF bit to clear the reset flags */
    RCC->CTRLSTS |= RCC_REMOVE_RESET_FLAG;
    /* RMVF bit should be reset */
    RCC->CTRLSTS &= ~RCC_REMOVE_RESET_FLAG;
}

/**
*\*\name    RCC_GetIntStatus.
*\*\fun     Checks whether the specified RCC interrupt has occurred or not.
*\*\param   interrupt_flag(RCC interrupt source to check):
*\*\	    -  RCC_INT_LSIRDIF    LSI ready interrupt
*\*\	    -  RCC_INT_HSIRDIF    HSI ready interrupt
*\*\return  The new state of RccInt 
*\*\         - SET
*\*\         - RESET
**/
INTStatus RCC_GetIntStatus(uint8_t interrupt_flag)
{
    INTStatus bitstatus;

    /* Check the status of the specified RCC interrupt */
    if ((RCC->CLKINT & interrupt_flag) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }

    /* Return the RccInt status */
    return bitstatus;
}

/**
*\*\name    RCC_ClrIntPendingBit.
*\*\fun     Clears the RCC's interrupt pending bits.
*\*\param   RccInt specifies the interrupt pending bit to clear.
*\*\	      -  RCC_CLR_LSIRDIF    Clear LSI ready interrupt flag
*\*\	      -  RCC_CLR_HSIRDIF    Clear HSI ready interrupt flag
*\*\return  none. 
 */
void RCC_ClrIntPendingBit(uint32_t interrupt_clear)
{
   /* Software set this bit to clear INT flag. */
    RCC->CLKINT |= interrupt_clear;
}

/**
*\*\name    RCC_EnableEMCReset.
*\*\fun     Configure whether to generate a reset request when an EMC error occurs.
*\*\param   EMC_type:
*\*\          - RCC_EMC_GB
*\*\          - RCC_EMC_GBN
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE   
*\*\return  none. 
**/
void RCC_EnableEMCReset(uint32_t EMC_type, FunctionalState Cmd)
{ 
   if (Cmd != DISABLE)
    {
        RCC->EMCCTRL |= (EMC_type<<1);
    }
    else
    {
        RCC->EMCCTRL &= (~(EMC_type<<1));
    }   
}

/**
*\*\name    RCC_EnableEMCDetect.
*\*\fun     Configure whether to enable EMC detection.
*\*\param   EMC_type:
*\*\          - RCC_EMC_GB
*\*\          - RCC_EMC_GBN
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE   
*\*\return  none. 
**/
void RCC_EnableEMCDetect(uint32_t EMC_type, FunctionalState Cmd)
{ 
   if (Cmd != DISABLE)
    {
        RCC->EMCCTRL |= EMC_type;
    }
    else
    {
        RCC->EMCCTRL &= ~EMC_type;
    }   
}

/**
*\*\name    RCC_EnableEMCSwitch.
*\*\fun     Configure whether to enable EMC switch.
*\*\param   EMC_type:
*\*\          - RCC_EMC_GB
*\*\          - RCC_EMC_GBN
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE   
*\*\return  none. 
**/
void RCC_EnableEMCSwitch(uint32_t EMC_type, FunctionalState Cmd)
{ 
   if (Cmd != DISABLE)
    {
        RCC->EMCCTRL |= (EMC_type<<2);
    }
    else
    {
        RCC->EMCCTRL &= (~(EMC_type<<2));
    }    
}

/**
*\*\name    RCC_ConfigEMCDetectLevel.
*\*\fun     Configures the voltage threshold detected by the EMC.
*\*\param   EMC_type:
*\*\          - RCC_EMC_GB
*\*\          - RCC_EMC_GBN
*\*\param   level (The input parameters must be the following values):
*\*\          - 0x0 ~ 0x3
*\*\return  none
**/
void RCC_ConfigEMCDetectLevel(uint32_t EMC_type, uint8_t level)
{
    uint32_t temp_value;
    
    temp_value = RCC->EMCCTRL;
    if(EMC_type == RCC_EMC_GB)
    {
        /* Clear GBDETSEL[9:8] bits bit */
        temp_value &= EMCCTRL_GBDETSEL_MASK;
        /* Set GBDETSEL[9:8] bits according to level value */
        temp_value |= ((uint32_t)level<<8);
    }
    else
    {
        /* Clear GBNDETSEL[17:16] bits bit */
        temp_value &= EMCCTRL_GBNDETSEL_MASK;
        /* Set GBNDETSEL[17:16] bits according to level value */
        temp_value |= ((uint32_t)level<<16);
        
