2zzyyyq/3C/n32g033_std_periph_driver/src/n32g033_rcc.c
    }
    /* Store the new value */
    RCC->EMCCTRL = temp_value;
}


/**
*\*\name    RCC_EnableGlitchDetect.
*\*\fun     Configure whether to enable Glitch.
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE   
*\*\return  none. 
**/
void RCC_EnableGlitchDetect(FunctionalState Cmd)
{ 
   if (Cmd != DISABLE)
    {
        RCC->EMCCTRL |= (RCC_EMCCTRL_GVDET);
    }
    else
    {
        RCC->EMCCTRL &= (~RCC_EMCCTRL_GVDET);
    }    
}

/**
*\*\name    RCC_EnableGlitchReset.
*\*\fun     Configure whether to enable Glitch reset.
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE   
*\*\return  none. 
**/
void RCC_EnableGlitchReset(FunctionalState Cmd)
{ 
   if (Cmd != DISABLE)
    {
        RCC->EMCCTRL |= (RCC_EMCCTRL_GVRST);
    }
    else
    {
        RCC->EMCCTRL &= (~RCC_EMCCTRL_GVRST);
    }    
}

/**
*\*\name    RCC_EnableGlitchSwitch.
*\*\fun     Configure whether to enable Glitch switch.
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE   
*\*\return  none. 
**/
void RCC_EnableGlitchSwitch(FunctionalState Cmd)
{ 
   if (Cmd != DISABLE)
    {
        RCC->EMCCTRL |= (RCC_EMCCTRL_GVSW);
    }
    else
    {
        RCC->EMCCTRL &= (~RCC_EMCCTRL_GVSW);
    }    
}


/**
*\*\name    RCC_ConfigGlitchDetectLevel.
*\*\fun     Configures the voltage threshold detected by the Glitch.
*\*\param   level (The input parameters must be the following values):
*\*\        - 0x0 ~ 0x1F
*\*\return  none
**/
void RCC_ConfigGlitchDetectLevel(uint8_t level)
{
    uint32_t temp_value;
    
    temp_value = RCC->EMCCTRL;
	/* Clear GVDETSEL[4:0] bits bit */
	temp_value &= EMCCTRL_GVDETSEL_MASK;
	/* Set GVDETSEL[4:0] bits according to level value */
	temp_value |= (uint32_t)level ;
    /* Store the new value */
    RCC->EMCCTRL = temp_value;
}

/**
*\*\name    RCC_EnableM0LockupReset.
*\*\fun     Configure whether to enable M0 lockup reset.
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE   
*\*\return  none. 
**/
void RCC_EnableM0LockupReset(FunctionalState Cmd)
{ 
   if (Cmd != DISABLE)
    {
        RCC->EMCCTRL |= (RCC_EMCCTRL_LKUPRSTEN);
    }
    else
    {
        RCC->EMCCTRL &= (~RCC_EMCCTRL_LKUPRSTEN);
    }    
}

/**
*\*\name    RCC_ConfigTimClk.
*\*\fun     Configures the TIM1/3/4 clock source(TIMCLK).
*\*\param   timer_clksrc(TIM clock source):
*\*\         - RCC_TIM_CLKSRC_SYSCLK
*\*\         - RCC_TIM_CLKSRC_HCLK  
*\*\return  none
**/
void RCC_ConfigTimClk(uint32_t timer_clksrc)  
{
    uint32_t temp_value;

    temp_value = RCC->CFG;
    /* Clear TIMXCLK_SEL bits */
    temp_value &= RCC_TIM_CLKSRC_MASK;
    /* Set TIMXCLK_SEL bits according to timer_clksrc value */
    temp_value |= timer_clksrc;

    /* Store the new value */
    RCC->CFG = temp_value;
}

/**
*\*\name    RCC_ConfigTim6Clk.
*\*\fun     Configures the TIM6 clock source(TIM6CLK).
*\*\param   timer_clksrc(TIM6 clock source):
*\*\         - RCC_TIM6_CLKSRC_SYSCLK
*\*\         - RCC_TIM6_CLKSRC_HCLK  
*\*\return  none
**/
void RCC_ConfigTim6Clk(uint32_t timer_clksrc)  
{
    uint32_t temp_value;

    temp_value = RCC->CFG;
    /* Clear TIM6CLK_SEL bits */
    temp_value &= RCC_TIM6_CLKSRC_MASK;
    /* Set TIM6CLK_SEL bits according to timer_clksrc value */
    temp_value |= timer_clksrc;

    /* Store the new value */
    RCC->CFG = temp_value;
}

/**
*\*\name    RCC_ConfigUart3Clk.
*\*\fun     Configures the UART3 clock source(UART3CLK).
*\*\param   uart3_clksrc(UART3 clock source):
*\*\         - RCC_UART3_CLKSRC_PCLK
*\*\         - RCC_UART3_CLKSRC_LSI  
*\*\return  none
**/
void RCC_ConfigUart3Clk(uint32_t uart3_clksrc)  
{
    uint32_t temp_value;

    temp_value = RCC->CFG;
    /* Clear UART3CLK_SEL bits */
    temp_value &= RCC_UART3_CLKSRC_MASK;
    /* Set UART3CLK_SEL bits according to timer_clksrc value */
    temp_value |= uart3_clksrc;

    /* Store the new value */
    RCC->CFG = temp_value;
}

/**
*\*\name    RCC_ConfigIOFilter.
*\*\fun     Configures the Speed of GPIO fliter.
*\*\param   ioflitclk_div value(IO Fliter clock is derived from the AHB clock (HCLK)):
*\*\        -0 ~ 0xF
*\*\return  none
**/
void RCC_ConfigIOFilter(uint32_t ioflitclk_div)
{
    uint32_t tmpregister;

    tmpregister = RCC->TIMFILTCFG;
    /* Clear IOFLITCLK[31:28] bits */
    tmpregister &= TIMFILTCFG_IOFLITCLK_MASK;
    /* Set IOFLITCLK[31:28] bits according to RCC_HCLK value */
    tmpregister |= ioflitclk_div;
    /* Store the new value */
    RCC->TIMFILTCFG = tmpregister;
}

/**
*\*\name    RCC_ConfigTIM4Filter.
*\*\fun     Configures the Speed of TIM4 fliter.
*\*\param   tim4flitclk_div value(TIM4 Fliter clock is derived from the AHB clock (HCLK)):
*\*\        -0 ~ 0x1F
*\*\return  none
**/
void RCC_ConfigTIM4Filter(uint32_t tim4flitclk_div)
{
    uint32_t tmpregister;

    tmpregister = RCC->TIMFILTCFG;
    /* Clear TIM4FILTCLK[20:16] bits */
    tmpregister &= TIMFILTCFG_TIM4FLITCLK_MASK;
    /* Set TIM4FILTCLK[20:16] bits according to RCC_HCLK value */
    tmpregister |= tim4flitclk_div;
    /* Store the new value */
    RCC->TIMFILTCFG = tmpregister;
}

/**
*\*\name    RCC_ConfigTIM3Filter.
*\*\fun     Configures the Speed of TIM3 fliter.
*\*\param   tim3flitclk_div value(TIM3 Fliter clock is derived from the AHB clock (HCLK)):
*\*\        -0 ~ 0x1F
*\*\return  none
**/
void RCC_ConfigTIM3Filter(uint32_t tim3flitclk_div)
{
    uint32_t tmpregister;

    tmpregister = RCC->TIMFILTCFG;
    /* Clear TIM3FILTCLK[12:8] bits */
    tmpregister &= TIMFILTCFG_TIM3FLITCLK_MASK;
    /* Set TIM3FILTCLK[12:8] bits according to RCC_HCLK value */
    tmpregister |= tim3flitclk_div;
    /* Store the new value */
    RCC->TIMFILTCFG = tmpregister;
}

/**
*\*\name    RCC_ConfigTIM1Filter.
*\*\fun     Configures the Speed of TIM1 fliter.
*\*\param   tim1flitclk_div value(TIM1 Fliter clock is derived from the AHB clock (HCLK)):
*\*\        -0 ~ 0x1F
*\*\return  none
**/
void RCC_ConfigTIM1Filter(uint32_t tim1flitclk_div)
{
    uint32_t tmpregister;

    tmpregister = RCC->TIMFILTCFG;
    /* Clear TIM1FILTCLK[4:0] bits */
    tmpregister &= TIMFILTCFG_TIM1FLITCLK_MASK;
    /* Set TIM1FILTCLK[4:0] bits according to RCC_HCLK value */
    tmpregister |= tim1flitclk_div;
    /* Store the new value */
    RCC->TIMFILTCFG = tmpregister;
}

/**
*\*\name    RCC_ConfigLSICalibPeriod.
*\*\fun     Configure LSI Calibration Period.
*\*\param   lsi_period:
*\*\	     - RCC_LSICAL_PERIOD_128   Count the HSI clock within 128 LSI cycles     
*\*\	     - RCC_LSICAL_PERIOD_256   Count the HSI clock within 256 LSI cycles
*\*\	     - RCC_LSICAL_PERIOD_512   Count the HSI clock within 512 LSI cycles
*\*\	     - RCC_LSICAL_PERIOD_1024  Count the HSI clock within 1024 LSI cycles
*\*\return  none
**/
void RCC_ConfigLSICalibPeriod(uint32_t lsi_period)  
{
    uint32_t temp_value;

    temp_value = RCC->CTRL;
    /* Clear LSICALLEN bits */
    temp_value &= CTRL_LSICALLEN_MASK;
    /* Set LSICALLEN bits according to lsi_period value */
    temp_value |= (lsi_period << 9);

    /* Store the new value */
    RCC->CTRL = temp_value;
}

/**
*\*\name    RCC_EnableLSICalibration.
*\*\fun     Configure whether to start LSI Calibration calculation.
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE   
*\*\return  none. 
**/
void RCC_EnableLSICalibration(FunctionalState Cmd)
{ 
   if (Cmd != DISABLE)
    {
        RCC->CTRL |= (RCC_CTRL_LSICALEN);
    }
    else
    {
        RCC->CTRL &= (~RCC_CTRL_LSICALEN);
    }    
}

/**
*\*\name    RCC_GetHSICalibPeriod
*\*\fun     Gets the HSI(64MHz) captures the number of LSI cycles within the clock calibration period.
*\*\param   none
*\*\return  HSI captures value.
**/
uint32_t RCC_GetHSICalibPeriod(void)
{   
    /* Get the LSICAL value */
    return (uint32_t)(RCC->LSICAL);
    
}


